app/views/videos/_video.html.erb

				<b>Mensaje:</b> <%= video.mensaje %><br>
				<b>Usuario: </b> <%= Usuario.find(video.usuario_id).email %><br>
---
SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = $1 LIMIT 1  [["id", "8"]]