app/views/usuarios/show.html.erb

<br>
	<% if @usuario.videos.any? %>
---
SELECT 1 AS one FROM "videos" WHERE "videos"."usuario_id" = $1 ORDER BY attach_updated_at DESC LIMIT 1  [["usuario_id", 8]]