app/controllers/sessions_controller.rb

	def create
		user = Usuario.find_by_email(params[:session][:email].downcase)
---
SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."email" = 'ok.garces10' LIMIT 1