app/controllers/static_pages_controller.rb

  def home
  	@videos = Video.where(:estado => Video.converted).paginate(page: params[:page], per_page: 30 ,order: ('fecha_publicado DESC'))
---
SELECT "videos".* FROM "videos" WHERE "videos"."estado" = 1 ORDER BY fecha_publicado DESC, attach_updated_at DESC LIMIT 30 OFFSET 0