app/controllers/usuarios_controller.rb

UPDATE "usuarios" SET "remember_token" = $1, "updated_at" = $2 WHERE "usuarios"."id" = 1  [["remember_token", "700dc6d1c2a26ff12fa533d9680ef29d6cc94197"], ["updated_at", Fri, 06 Sep 2013 03:13:52 UTC +00:00]]
---
  def create
    @usuario = Usuario.create(usuario_params)

    respond_to do |format|
      if @usuario.save