app/controllers/usuarios_controller.rb

  def index
    @usuarios = Usuario.paginate(page: params[:page], per_page: 2, order: 'nombre ASC')
---
SELECT "usuarios".* FROM "usuarios" ORDER BY nombre ASC LIMIT 2 OFFSET 0
SELECT COUNT(*) FROM "usuarios"

  def show
    @usuario = Usuario.find(params[:id])
    @videos = @usuario.videos.paginate(page: params[:page], per_page: 30, order: 'fecha_upload DESC')
---
SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "videos".* FROM "videos" WHERE "videos"."usuario_id" = $1 ORDER BY fecha_upload DESC, attach_updated_at DESC LIMIT 30 OFFSET 0  [["usuario_id", 8]]
SELECT COUNT(*) FROM "videos" WHERE "videos"."usuario_id" = $1  [["usuario_id", 8]]

  def edit
    @usuario = Usuario.find(params[:id])
---
SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = $1 LIMIT 1  [["id", "2"]]

  def create
    @usuario = Usuario.new(usuario_params)

    respond_to do |format|
      if @usuario.save
---
INSERT INTO "usuarios" ("created_at", "password_digest", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Wed, 04 Sep 2013 08:30:44 UTC +00:00], ["password_digest", "$2a$10$RQCHelziry3IIArM5zfLQue1Ih.0b06ea6pvoTKh.e8ufLysNKNRe"], ["updated_at", Wed, 04 Sep 2013 08:30:44 UTC +00:00]]

  def update
    @usuario = Usuario.find(param[:id])
    respond_to do |format|
      if @usuario.update(usuario_params)
---
SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = $1 LIMIT 1  [["id", "2"]]
UPDATE "usuarios" SET "password_digest" = $1, "updated_at" = $2 WHERE "usuarios"."id" = 2  [["password_digest", "$2a$10$ibt9mWUQjOkd9jEAp7HTPeOsnNJ5xPXY82U3RNeXy4/NF3fD0YjG."], ["updated_at", Wed, 04 Sep 2013 08:33:26 UTC +00:00]]