app/controllers/videos_controller.rb

SELECT "videos".* FROM "videos" ORDER BY fecha_upload DESC
---
  def index
    @videos = Video.paginate(page: params[:page], per_page: 2, order: 'nombre ASC')

INSERT INTO "videos" ("created_at", "mensaje", "nombre", "updated_at", "usuario_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Thu, 05 Sep 2013 21:08:10 UTC +00:00], ["mensaje", "asdasd"], ["nombre", "Nueva "], ["updated_at", Thu, 05 Sep 2013 21:08:10 UTC +00:00], ["usuario_id", 8]]
---
  def create
    @video = current_user.videos.build(video_params)
    respond_to do |format|
      if @video.save

SELECT "videos".* FROM "videos" WHERE "videos"."id" = $1 ORDER BY fecha_upload DESC LIMIT 1  [["id", "1"]]
---
    def set_video
      @video = Video.find(params[:id])